[
  {
    "title": "a",
    "description": "a",
    "location": "a",
    "email": "a@gmail.com",
    "jobType": "Full-time",
    "workNature": "On-site",
    "clientName": "a",
    "jobDuration": "16",
    "payPerHour": "37"
  },
  {
    "title": "a",
    "description": "About the job\nGoFormz is a San Diego-based startup leading the mobile data capture industry. We empower businesses to replace paper forms with web and mobile-based digital forms that provide global access to the collected data. We are currently looking for a solution focused Azure AI Engineer to add to our growing team. We do everything from modern React apps to cross-platform mobile app development to extensive API development in a microservices architecture.\n\n\nAs an Azure AI Engineer, you will collaborate closely with a cross-functional team of engineers and technical product managers to enhance our platform with AI-powered features, transforming how our customers engage with our services. In this role, you will develop and integrate Azure AI services into our existing applications, making a tangible impact on the customer experience. You will be a key contributor to production code, and the solutions you build will become an integral part of the daily lives of thousands of our customers.\n\n\nResponsibilities:\n•\tDesign, develop, deploy, and support Azure AI software components \n•\tMonitor, maintain, and optimize AI applications for performance and scalability.\n•\tIntegrate AI capabilities into applications, leveraging Azure AI Services\n•\tCoordinate with stakeholders to align AI solutions with organizational goals.\n•\tStaying up to date on AI trends and ethical considerations, such as data privacy and mitigating bias in AI systems\n•\tDevelop and maintain microservice APIs using C# and .Net\n•\tDevelop and maintain our front-end React application\n•\tDevelop and maintain our cross-platform MAUI mobile apps\n•\tParticipate in weekly releases\n•\tMentor junior software developers by advocating for best practices.\n•\tPerform code reviews\n•\tMeet weekly with team to discuss ongoing projects\n•\tExtend and document changes to existing subsystems as needed\n \nRequirements:\n•\t6+ years of experience\n•\tBachelor's degree in computer science or related field\n•\tC# / .NET\n•\tRESTful APIs\n•\tSQL and/or non-relational databases\n•\tHands-on experience with Azure AI services (Search, Vision, Speech, Vision, and Docs).\n•\tFamiliarity with the latest trends in AI and machine learning.\n•\tExperience with large language models (LLMs) and vector databases\n•\tKnowledge of data governance, security, and AI compliance standards in Azure.\n•\tExperience with microservice architecture\n•\tExperience working in an Agile environment\n•\tExpertise in building secure, scalable, enterprise systems\n•\tStrong communication skills for explaining AI concepts to non-technical stakeholders.\n\n\nNice to Have:\n•\tAzure AI Certification(s)\n•\tExperience with Microsoft Fabric, Azure Data Factory or Azure Synapse Analytics.\n•\tAzure Functions / Service Bus / Event Hubs\n•\tCI/CD pipelines - Azure DevOps\n•\tNoSQL Databases - MongoDB & Cosmos\n•\tDapper – or other microORM\n•\tReact - or other modern JavaScript framework\n•\tSQL - or other relational database\n•\tDocker, Kubernetes, or Container Apps\n•\tExperience with Azure Application Insights\n•\tExperience with database schema design and query optimization \n\n\n",
    "location": "a",
    "email": "a@gmail.com",
    "jobType": "Full-time",
    "workNature": "On-site",
    "clientName": "a",
    "jobDuration": "16",
    "payPerHour": "37"
  }
]